backend/app/controllers/releases_controller.rb

  def index
    releases = Release.all
---
SELECT "releases".* FROM "releases"

  def create
    release = Release.new(release_params)

    if release.save
---
INSERT INTO "releases" ("title", "release_type", "show_id", "year", "result_type", "poster_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"