backend/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "wonton"], ["email", "wonton@email.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-06-26 09:24:20.802419"], ["updated_at", "2023-06-26 09:24:20.802419"]]